import streamlit as st
from operators import add, subtraction, mult, division, modol1

st.title("Operators = סדרות תווים")

st.markdown("""
##### יש כמה סוגים של אופרטורים
 1. '+' :    חיבור
-  5+3
2. '-'     :    חיסור  
- 5-6
3.  '*'  : כפל
- 6 * 3
4. /     :  חילוק
- 4 / 3
""")

c1, c2, c3, c4 = st.columns(4)
if c1.button("חיבור"):
    add()
    st.markdown("""
    ### תוצאה
    7
    """)
if c2.button("חיסור"):
    subtraction()
    st.markdown("""
    ### תוצאה
    -1
    """)
if c3.button("כפל"):
    mult()
    st.markdown("""
    ### תוצאה
    12
    """)
if c4.button("חילוק"):
    division()
    st.markdown("""
    ### תוצאה
    0
    """)

st.markdown("""
### יש עוד סוג אחד מיוחד קוראים לו מודולו - שארית החלוקה 
""")
st.subheader("%")
st.markdown("""


שארית החלוקה היא המספר שנותר לנו כאשר אנחנו חולקים מספר מסוים במספר אחר.

הסימן "%" הוא הסימן שמסמל שארית החלוקה במתמטיקה ובשפות תכנות.
""")

st.markdown("""
לדוגמא:
#### 3 % 2  = 1
כאשר אני מחלק את 3 ב 2 התוצאה של החילוק הוא 1 אבל נשאר לי שארית 1 ולכן השארית החלוקה תהיה 1
""")
st.text("\n\n\n")
st.write("""
אם מספר לא מתחלק במספר אחר אז השארית חלוקה זה המספר עצמו
""")

st.markdown("""
לדוגמא:
#### 2 % 7 = 2
מכיון שהמספר 2 לא מתחלק ב 7 השארית זה כל המספר 2
""")
st.markdown("""
##### נראה כמה תרגילים ודוגמאות 
""")
modol1()

st.markdown("""
        ### תוצאה
        ### 1
        מכיון ש 5 מתחלק פעמים ב -2 ונשאר לו שארית של 1 
        
        """)

if st.button("שארית החלוקה"):

    pass
